GUdaoxi/demo_qspi/LPTIM16_Timing/Drivers/FM33FH0xx_FL_Driver/Inc/fm33fh0xx_fl_dac.h
 /**    
  *******************************************************************************************************
  * @file    fm33fh0xx_fl_dac.h
  * @author  FMSH Application Team
  * @brief   Header file of FL Driver Library
  ******************************************************************************************************* 
  * @attention    
  * Copyright 2024 SHANGHAI FUDAN MICROELECTRONICS GROUP CO., LTD.(FUDAN MICRO.)
  *        
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met: 
  *    
  * 1. Redistributions of source code must retain the above copyright notice, 
  *    this list of conditions and the following disclaimer.
  *    
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  *    
  * 3. Neither the name of the copyright holder nor the names of its contributors 
  *    may be used to endorse or promote products derived from this software without
  *    specific prior written permission.
  *    
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS “AS IS”
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE   
  * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
  * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
  * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT   
  * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
  * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.    
  *
  *******************************************************************************************************
  */    


/* Define to prevent recursive inclusion---------------------------------------------------------------*/
#ifndef __FM33FH0XX_FL_DAC_H
#define __FM33FH0XX_FL_DAC_H

#ifdef __cplusplus
extern "C" {
#endif
/* Includes -------------------------------------------------------------------------------------------*/
#include "fm33fh0xx_fl_def.h"
/** @addtogroup FM33FH0XX_FL_Driver
  * @{
  */

/* Exported types -------------------------------------------------------------------------------------*/
/** @defgroup DAC_FL_ES_INIT DAC Exported Init structures
  * @{
  */

/**
  * @brief FL DAC Init Sturcture definition
  */
typedef struct
{
    /*DAC触发模式使能配置*/
    uint32_t triggerMode;
    /*DAC触发源配置*/
    uint32_t triggerSource;
    /*DAC保持时间配置*/
    uint32_t holdTime;
    /*DAC采样时间配置*/
    uint32_t sampleTime;
    /*DAC反馈开关0配置*/
    uint32_t switchMode0;
    /*DAC反馈开关1配置*/
    uint32_t switchMode1;

} FL_DAC_InitTypeDef;
/**
  * @}
  */
/* Exported constants ---------------------------------------------------------------------------------*/
/** @defgroup DAC_FL_Exported_Constants DAC Exported Constants
  * @{
  */

#define    DAC_CR1_EN_Pos                                         (0U)
#define    DAC_CR1_EN_Msk                                         (0x1U << DAC_CR1_EN_Pos)
#define    DAC_CR1_EN                                             DAC_CR1_EN_Msk

#define    DAC_CR2_DMAEN_Pos                                      (1U)
#define    DAC_CR2_DMAEN_Msk                                      (0x1U << DAC_CR2_DMAEN_Pos)
#define    DAC_CR2_DMAEN                                          DAC_CR2_DMAEN_Msk

#define    DAC_CR2_TRGEN_Pos                                      (0U)
#define    DAC_CR2_TRGEN_Msk                                      (0x1U << DAC_CR2_TRGEN_Pos)
#define    DAC_CR2_TRGEN                                          DAC_CR2_TRGEN_Msk

#define    DAC_CFGR_SHEN_Pos                                      (8U)
#define    DAC_CFGR_SHEN_Msk                                      (0x1U << DAC_CFGR_SHEN_Pos)
#define    DAC_CFGR_SHEN                                          DAC_CFGR_SHEN_Msk

#define    DAC_CFGR_BUFEN_Pos                                     (7U)
#define    DAC_CFGR_BUFEN_Msk                                     (0x1U << DAC_CFGR_BUFEN_Pos)
#define    DAC_CFGR_BUFEN                                         DAC_CFGR_BUFEN_Msk

#define    DAC_CFGR_TRGSEL_Pos                                    (2U)
#define    DAC_CFGR_TRGSEL_Msk                                    (0xfU << DAC_CFGR_TRGSEL_Pos)
#define    DAC_CFGR_TRGSEL                                        DAC_CFGR_TRGSEL_Msk

#define    DAC_CFGR_SWIEN1_Pos                                    (1U)
#define    DAC_CFGR_SWIEN1_Msk                                    (0x1U << DAC_CFGR_SWIEN1_Pos)
#define    DAC_CFGR_SWIEN1                                        DAC_CFGR_SWIEN1_Msk

#define    DAC_CFGR_SWIEN0_Pos                                    (0U)
#define    DAC_CFGR_SWIEN0_Msk                                    (0x1U << DAC_CFGR_SWIEN0_Pos)
#define    DAC_CFGR_SWIEN0                                        DAC_CFGR_SWIEN0_Msk

#define    DAC_SWTRGR_SWTRIG_Pos                                  (0U)
#define    DAC_SWTRGR_SWTRIG_Msk                                  (0x1U << DAC_SWTRGR_SWTRIG_Pos)
#define    DAC_SWTRGR_SWTRIG                                      DAC_SWTRGR_SWTRIG_Msk

#define    DAC_DHR_DHR_Pos                                        (0U)
#define    DAC_DHR_DHR_Msk                                        (0xfffU << DAC_DHR_DHR_Pos)
#define    DAC_DHR_DHR                                            DAC_DHR_DHR_Msk

#define    DAC_IER_DMAE_IE_Pos                                    (3U)
#define    DAC_IER_DMAE_IE_Msk                                    (0x1U << DAC_IER_DMAE_IE_Pos)
#define    DAC_IER_DMAE_IE                                        DAC_IER_DMAE_IE_Msk

#define    DAC_IER_EOH_IE_Pos                                     (2U)
#define    DAC_IER_EOH_IE_Msk                                     (0x1U << DAC_IER_EOH_IE_Pos)
#define    DAC_IER_EOH_IE                                         DAC_IER_EOH_IE_Msk

#define    DAC_IER_EOS_IE_Pos                                     (1U)
#define    DAC_IER_EOS_IE_Msk                                     (0x1U << DAC_IER_EOS_IE_Pos)
#define    DAC_IER_EOS_IE                                         DAC_IER_EOS_IE_Msk

#define    DAC_IER_DOU_IE_Pos                                     (0U)
#define    DAC_IER_DOU_IE_Msk                                     (0x1U << DAC_IER_DOU_IE_Pos)
#define    DAC_IER_DOU_IE                                         DAC_IER_DOU_IE_Msk

#define    DAC_ISR_DMAERR_Pos                                     (3U)
#define    DAC_ISR_DMAERR_Msk                                     (0x1U << DAC_ISR_DMAERR_Pos)
#define    DAC_ISR_DMAERR                                         DAC_ISR_DMAERR_Msk

#define    DAC_ISR_EOH_Pos                                        (2U)
#define    DAC_ISR_EOH_Msk                                        (0x1U << DAC_ISR_EOH_Pos)
#define    DAC_ISR_EOH                                            DAC_ISR_EOH_Msk

#define    DAC_ISR_EOS_Pos                                        (1U)
#define    DAC_ISR_EOS_Msk                                        (0x1U << DAC_ISR_EOS_Pos)
#define    DAC_ISR_EOS                                            DAC_ISR_EOS_Msk

#define    DAC_ISR_DOU_Pos                                        (0U)
#define    DAC_ISR_DOU_Msk                                        (0x1U << DAC_ISR_DOU_Pos)
#define    DAC_ISR_DOU                                            DAC_ISR_DOU_Msk

#define    DAC_SHTR_THLD_Pos                                      (8U)
#define    DAC_SHTR_THLD_Msk                                      (0xffffU << DAC_SHTR_THLD_Pos)
#define    DAC_SHTR_THLD                                          DAC_SHTR_THLD_Msk

#define    DAC_SHTR_TSMPL_Pos                                     (0U)
#define    DAC_SHTR_TSMPL_Msk                                     (0xffU << DAC_SHTR_TSMPL_Pos)
#define    DAC_SHTR_TSMPL                                         DAC_SHTR_TSMPL_Msk






